[
  {
    "link": "https://namskra.is/courses/590c780162933a4e9204deef",
    "comment": "",
    "description": "Í áfanganum fá nemendur þjálfun í forritun. Farið er í undirstöðuatriði forritunar svo sem skilyrðissetningar, slaufur, aðferðir, fylki og strengjavinnslu. Nemendur vinna verkefni í tímum sem reyna á færni þeirra og getu varðandi þessi atriði. Lögð er áhersla á að nemendur temji sér öguð og viðurkennd vinnubrögð við forritun. ",
    "core": true,
    "active": true,
    "tbr": true,
    "bval": 0,
    "course_number": "FORR1FG05(AU)",
    "course_name": "Forritun I",
    "prerequisites": []
  },
  {
    "link": "https://namskra.is/courses/5919aae562933a4e92054474",
    "comment": "Má taka samhliða FORR1FG05(AU)",
    "description": "Valáfangi í forritun þar sem nemendur undirbúa sig fyrir Forritunarkeppni framhaldsskólanna og lýkur áfanganum með þátttöku í forritunarkeppninni. ",
    "core": false,
    "active": true,
    "tbr": true,
    "bval": 2,
    "course_number": "FORK2FE02(AU)",
    "course_name": "Forritunarkeppni I ",
    "prerequisites": [
      "FORR1FG05(AU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5919abc962933a4e9205448e",
    "comment": "",
    "description": "Valáfangi í forritun þar sem nemendur undirbúa sig fyrir Forritunarkeppni framhaldsskólanna og lýkur áfanganum með þátttöku í forritunarkeppninni. ",
    "core": false,
    "active": true,
    "tbr": true,
    "bval": 2,
    "course_number": "FORK2FT02(BU)",
    "course_name": "Forritunarkeppni II ",
    "prerequisites": [
      "FORR2FA05(BU)",
      "FORK2FE02(AU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5919acd562933a4e9205449d",
    "comment": "",
    "description": "Valáfangi í forritun þar sem nemendur undirbúa sig fyrir Forritunarkeppni framhaldsskólanna og lýkur áfanganum með þátttöku í forritunarkeppninni. ",
    "core": false,
    "active": true,
    "tbr": true,
    "bval": 2,
    "course_number": "FORK2FÞ02(CU)",
    "course_name": "Forritunarkeppni III ",
    "prerequisites": [
      "FORK2FT02(BU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5919696b62933a4e9205418c",
    "comment": "",
    "description": "Í áfanganum er unnið með gagnategundir, aðferðir (e. methods), fylki, lista og skrár. Nemendur kynnast klasasöfnum og ýmsum atriðum við hönnun forrita sem eru nátengd hlutbundinni forritun. Fjölmörg verkefni eru unnin á önninni sem gefa nemendum innsýn í hlutbundna forritun.",
    "core": true,
    "active": true,
    "tbr": true,
    "bval": 0,
    "course_number": "FORR2FA05(BU)",
    "course_name": "Forritun II",
    "prerequisites": [
      "FORR1FG05(AU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/591c4aeb62933a4e920559b5",
    "comment": "",
    "description": "Í áfanganum er farið í grunnatriði vefsíðuhönnunar og megináhersla lögð á ívafsmál (e. HTML) og stílsíður (e. CSS). Hver þessara þátta er tekinn sérstaklega fyrir og sýnt hvernig samspil þeirra stuðlar að vandaðri uppsetningu og framsetningu vefsíðna. Skoðuð er þróunarsaga vefsins, hlutverk vafrans (e. Internet browser) og virkni hans.",
    "core": true,
    "active": true,
    "tbr": true,
    "bval": 0,
    "course_number": "VEFÞ1VG05(AU)",
    "course_name": "Vefþróun I",
    "prerequisites": []
  },
  {
    "link": "https://namskra.is/courses/591c4ca162933a4e920559c0",
    "comment": "",
    "description": "Í áfanganum vinna nemendur að sveigjanlegri vefsíðuhönnun (e. Responsive Web Design) og skoða mismunandi aðferðir við uppsetningu (e. layout) snjallvefsíðna. Farið er í stílsetningu viðmiðunarmarka (e. breakpoints) í stílsíðu. Farið er í uppsetningu á samskiptaformi og töflu.  Nemendur vinna með kvikun (e. animation) til að lífga upp á vefsíður og til að ná fram gagnvirkni í samskiptum vafra við notendur.   ",
    "core": true,
    "active": true,
    "tbr": true,
    "bval": 0,
    "course_number": "VEFÞ2VH05(BU)",
    "course_name": "Vefþróun II",
    "prerequisites": [
      "VEFÞ1VG05(AU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/59196cc162933a4e920541d2",
    "comment": "",
    "description": "Í áfanganum er lögð áhersla á að nemendur geti þróað hugbúnað samkvæmt hlutbundinni aðferðafræði og geti valið þær leiðir sem best eiga við hverju sinni. Klasahugtakið er fyrirferðamikið í þessum áfanga og læra nemendur að hanna og útfæra klasa og nota klasasöfn. Áfram verður unnið með aðferðir, lista, fylki, strengjavinnslu og skráarvinnslu. Nemendur vinna mismunandi verkefni sem reyna á færni þeirra og getu varðandi þessi atriði. ",
    "core": true,
    "active": true,
    "tbr": true,
    "bval": 0,
    "course_number": "FORR2HF05(CU)",
    "course_name": "Hlutbundin forritun",
    "prerequisites": [
      "FORR2FA05(BU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5dd693d2e3d27fe43f0004de",
    "comment": "",
    "description": "Í áfanganum læra nemendur að setja upp og nota Linux stýrikerfið. Áhersla er lögð á að nemendur læri að vinna í skipanalínu. Nemendur kynnast grunnatriðum í skriftum í Linux og lögð er áhersla á að þeir geti nýtt skriftur í sem flestu sem snýr að umsjón Linux stýrikerfisins. Í áfanganum verður einnig kennd notkun á útgáfustýringarforritinu git og nemendur þjálfaðir í notkun þess.",
    "core": true,
    "active": true,
    "tbr": true,
    "bval": 0,
    "course_number": "KEST1VL05(AU)",
    "course_name": "Tölvutækni - Vinnulag og Linux",
    "prerequisites": []
  },
  {
    "link": "https://namskra.is/courses/5dd6956ae3d27fe43f0004ef",
    "comment": "",
    "description": "Í áfanganum er megináhersla á vélbúnað og stýrikerfi. Nemendur setja saman tölvu, setja upp stýrikerfi, uppfæra BIOS, rekla og stýrikerfi. Farið er í hlutverk og samskipti mismunandi íhluta tölvunnar, s.s. örgjörva og minni, samskipti við viðskiptavini og þjónustuborð og förgun á tölvubúnaði. Fjallað er um tengingu og uppsetningu á jaðartækjum. Tengdar eru saman tvær eða fleiri tölvur þannig að þær geti haft samskipti sín á milli. Nemendur vinna með ýmsar stillingar í Windows stýrikerfinu, búa til notendur og hópa auk þess sem notkun aðgangsstýringa í Windows er skoðuð og æfð. Nemendur fá kynningu og æfa notkun á skriftum í Windows.",
    "core": true,
    "active": true,
    "tbr": true,
    "bval": 0,
    "course_number": "KEST2VW05(BU)",
    "course_name": "Tölvutækni - vélbúnaður og Winodws",
    "prerequisites": [
      "KEST1VL05(AU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5dd69700e3d27fe43f000502",
    "comment": "",
    "description": "Í áfanganum er farið í undirstöðuatriði netkerfa. Farið er yfir hvernig netbúnaður hefur samskipti, vistföng og algengar netþjónustur. Einnig er farið í uppbyggingu heimanets og undirstöðuatriði í öryggisstillingum. Einnig er farið í prófanir og bilanagreiningu á netkerfisbúnaði.",
    "core": true,
    "active": true,
    "tbr": true,
    "bval": 0,
    "course_number": "KEST2UN05(CU)",
    "course_name": "Tölvutækni - undirstöðuatriði netkerfa",
    "prerequisites": [
      "KEST2VW05(BU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/591992ca62933a4e920543f4",
    "comment": "",
    "description": "Í áfanganum er farið í tvö mikilvæg atriði tölvunarfræðinnar, gagnaskipan og reiknirit. Farið er yfir þekkt reiknirit (e. algorithms) í tölvunarfræði sem og almenna gagnaskipan. Nemendur kynnast ýmsum gerðum reiknirita, uppbyggingu þeirra og smíði. Nemendur fá einnig innsýn í hlutverk gagnaskipunar í hugbúnaði og hvernig mismunandi skipan er leidd af mismunandi hugmyndum. Nemendur fá einnig tækifæri til að hanna og smíða fjölda forrita sem styrkja þekkingu þeirra á námsefninu.",
    "core": false,
    "active": false,
    "tbr": true,
    "bval": 2,
    "course_number": "FORR3RR05(DU)",
    "course_name": "Reiknirit",
    "prerequisites": [
      "FORR2HF05(CU)",
      "STÆR3FM05(DT)"
    ]
  },
  {
    "link": "https://namskra.is/courses/59198ad362933a4e920543b3",
    "comment": "",
    "description": "Áfanginn er hugsaður sem almennur inngangur að leikjagerð. Í honum kynnast nemendur þeim grunnatriðum sem flestir tölvuleikir byggjast á. Kynnt eru hin ýmsu söfn (e. libraries) sem notuð eru við smíði tölvuleikja. Farið er yfir hljóð og mynd og hlutverk þeirra í upplifun notandans. Einnig er skoðað hvernig söguþráður og markmið leiksins stýra því hvernig hann er þróaður. Aðaláherslan er þó á forritun leikja og þau sértæku verkefni sem blasa við forritaranum. Ýmis ólík verkefni eru unnin með það að markmiði að gefa nemendum innsýn í heim tölvuleikjagerðar.",
    "core": false,
    "active": true,
    "tbr": true,
    "bval": 2,
    "course_number": "FORR2GL05(DU)",
    "course_name": "Leikjaforritun I",
    "prerequisites": [
      "FORR2HF05(CU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/59198c9d62933a4e920543cc",
    "comment": "",
    "description": "Í áfangnum er farið dýpra í grafík og hljóð í tölvuleikjum og sérstök áhersla er sett á rúllandi bakgrunn (e. scrolling background) og þýðingu hans fyrir tölvuleiki almennt. Kynnt verður hvernig hagnýta má ýmis eðlisfræðilögmál í leikjagerð. Byrjunaratriði í gerfigreind verða líka til umfjöllunar. Einnig er skoðuð sú grein leikja sem kallast platformers. Í lokin er farið yfir sértæk verkefni í fjölspilunarleikjum. Öll umgjörð leiks færist nú frá stigi frumgerða yfir í fullvaxta tölvuleik.",
    "core": false,
    "active": true,
    "tbr": true,
    "bval": 2,
    "course_number": "FORR3FL05(EU)",
    "course_name": "Leikjaforritun II",
    "prerequisites": [
      "FORR2GL05(DU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5919869b62933a4e9205438c",
    "comment": "",
    "description": "Í áfanganum er farið vel í forritunarmálið JavaScript. Unnið er með DOM (e. Document Object Model) í veflausnum. Söfn eru skoðuð og notuð til að einfalda verk og við þróun lausna. Saga og þróun JavaScripts er skoðuð með hljóðsjón til vefþróunar. Nemendur vinna að þróun gagnvirkra viðmótsforrita með notkun JavaScript.",
    "core": false,
    "active": true,
    "tbr": true,
    "bval": 2,
    "course_number": "FORR3JS05(DU)",
    "course_name": "JavaScript",
    "prerequisites": [
      "FORR2HF05(CU)",
      "VEFÞ2VH05(BU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5919888862933a4e9205439d",
    "comment": "",
    "description": "Í áfanganum fást nemendur við eftirfarandi viðfangsefni: notendaupplifun (e. UX), notendaviðmót (e. UI) og viðmótsforritun fyrir mismunandi aðstæður og umhverfi. Söfn, tæki og tól eru skoðuð og notuð við þróun afurðar. Nemendur vinna að smíði gagnvirkrar afurðar.",
    "core": false,
    "active": true,
    "tbr": true,
    "bval": 2,
    "course_number": "FORR3FV05(EU)",
    "course_name": "Viðmótsforritun",
    "prerequisites": [
      "FORR3JS05(DU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/591c517262933a4e920559e9",
    "comment": "",
    "description": "Í áfanganum læra nemendur uppsetningu gagnvirks vefjar á vefþjón. Farið er í varðveislu gagna, notkun gagnasniðs (e. data format) og þáttun (e. parsing) þeirra í vef. Nemendur vinna að gerð vefja með gagnagrunni.",
    "core": false,
    "active": true,
    "tbr": true,
    "bval": 2,
    "course_number": "VEFÞ3VÞ05(DU)",
    "course_name": "Vefþróun IV",
    "prerequisites": [
      "VEFÞ2VF05(CU)",
      "FORR3JS05(DU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5dd7a8a0e3d27faddc0002ac",
    "comment": "Má taka samhliða EÐLI2GR05(BT).",
    "description": "Í áfanganum kynnast nemendur vélmennum, hvað er vélmenni og hvaða tækni er notuð í vélmennum. Nemendur kynnast  lausnaraðferðum, verkefnastjórnun, samvinnu og að nýta sér þá þekkingu í stærðfræði, eðlisfræði og forritun sem þeir hafa þegar vald á.  Eftirfarandi námsþættir verða kenndir: niðurbrot vandamála úr flókinni  hegðun í einafalda hegðun (e. behavior), gerð flæðirita og sauðakóða og að lokum forritun sem vélmenni skilur, hreyfing (fram, aftur, snúningur) tími  og staða, fjarstýringar (bylgjufræði) og nemar.",
    "core": false,
    "active": true,
    "tbr": true,
    "bval": 2,
    "course_number": "ROBO2RG05(AU)",
    "course_name": "Vélmenni I",
    "prerequisites": [
      "FORR2FA05(BU)",
      "EÐLI2GR05(BT)",
      "VESM2VÞ05(CU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5dd69310e3d27fe43f0004d3",
    "comment": "",
    "description": "Í áfanganum leysa nemendur stórt verkefni sem er fyrirframskilgreint. Nemendur gera verkáætlun þar sem verkefnið er brotið niður í minnstu einingar.  Logskrár, verkáætlun, auðlindir þ.e vélbúnaður og hugbúnaður sem til þarf, flæðirit, sauðakóði og innleiðing.  Öllu er steypt saman í lokaskýrslu.  ",
    "core": false,
    "active": true,
    "tbr": true,
    "bval": 2,
    "course_number": "ROBO3RF05(BU)",
    "course_name": "Vélmenni II",
    "prerequisites": [
      "ROBO2RG05(AU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/591c4cd162933a4e920559c4",
    "comment": "",
    "description": "Í áfanganum eru grunnatriði vefforritunar kynnt. Farið er í miðlara/biðlara uppbyggingu vefsíðna, samskipti þeirra og hlutverk hvers hluta. Nemendur vinna að smíði vefja með miðlaramáli. Lögð er áhersla á málfræði og endurnýtni á kóða í gerð vefja.",
    "core": true,
    "active": true,
    "tbr": true,
    "bval": 0,
    "course_number": "VEFÞ2VF05(CU)",
    "course_name": "Vefþróun III",
    "prerequisites": [
      "FORR2FA05(BU)",
      "VEFÞ2VH05(BU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5dd69030e3d27fe43f0004b5",
    "comment": "",
    "description": "Í áfanganum kynnast nemendur helstu hugtökum gagnasafnsfræðinnar. Áhersla er lögð á vensluð gagnasöfn og nýtingu þeirra í gegnum fyrirspurnarmálið SQL. Nemendur læra undirstöðuatriði í hönnungangagrunna og smíði þeirra. Farið er sérstaklega í greiningu og flokkun  gagna í töflur og hvernig gögn venslast saman samkvæmt regluverki gagnasafnsfræðinnar. Nemendur kynnast grunnþáttum fyrirspurnarmálsins SQL og læra beitingu þess við smíðar, uppfærslu og vinnu með vensluð gögn í gagnagrunnum. Einnig eru kynntar vistaðar stefjur (e. stored procedures) og föll. Er notkun þeirra kynnt og æfð.  Í áfanganum er þekkingaröflun studd fjölda verkefna og rædd eru ýmis álitamál sem upp koma við hönnun.",
    "core": true,
    "active": true,
    "tbr": true,
    "bval": 0,
    "course_number": "GAGN2HS05(BU)",
    "course_name": "Gagnasafnsfræði - Hönnun og smíði",
    "prerequisites": [
      "FORR2FA05(BU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/591c1a0262933a4e92055808",
    "comment": "",
    "description": "Í áfanganum er áfram unnið að aukinni þekkingu á grunnatriðum gagnagrunnshönnunar. Farið er sérstaklega í normalform og forsendur fyrir mikilvægi þeirra. Skilningur nemenda er dýpkaður á JOIN og SUBQUERY fyrirspurnum og mikilvægi þeirra tíundað í því ferli að breyta gögnum í upplýsingar. Höfuðáhersla er á notkun viðauka við SQL staðalinn, svokallaða stefjuforritun. Farið er vel í vistaðar stefjur og föll og hagnýting þeirra í gagnagrunnsvinnslu tíundaðar. Kynntar eru ýmsar leiðir til gagnavinnslu með slíkum stefjum en einnig með svonefndum sýnum (e. view). Nemendur fá innsýn í útfærslu flóknari reglna í gagnasöfnum með rofum (e. trigger). Tenging gagnagrunna við forrit og/eða vef er kynnt og skoðaðar hefðbundnar leiðir í gagnagrunnsháðum hugbúnaði.",
    "core": false,
    "active": true,
    "tbr": true,
    "bval": 2,
    "course_number": "GAGN2VG05(CU)",
    "course_name": "Gagnasafnsfræði - Venslaðir gagnagrunnar",
    "prerequisites": [
      "GAGN2HS05(BU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/591c26f062933a4e920558ae",
    "comment": "Má taka samhliða KEST2UN05(CU)",
    "description": "Í áfanganum er farið í helstu skipanir í Linux umhverfinu og nemendur kynnast muninum á því að vera notandi og stjórnandi í Linux umhverfi í gegnum terminal vinnu. Farið er í þætti eins og skeljar, skráarvinnslu, skráarvernd, afritun, pípur, síur, ræsingu, lokun, diskastýringar og pakkakerfi. Stuðst er við kennsluefni frá NDG sem undirbýr nemendur undir alþjóðlegt próf LPIC-1.",
    "core": false,
    "active": false,
    "tbr": true,
    "bval": 2,
    "course_number": "KEST2LG05(DU)",
    "course_name": "Linux - kerfisstjórnun",
    "prerequisites": [
      "KEST2UN05(CU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/591c26f062933a4e920558ae",
    "comment": "Má taka samhliða KEST2UN05(CU)",
    "description": "Í áfanganum er farið í helstu skipanir í Linux umhverfinu og nemendur kynnast muninum á því að vera notandi og stjórnandi í Linux umhverfi í gegnum terminal vinnu. Farið er í þætti eins og skeljar, skráarvinnslu, skráarvernd, afritun, pípur, síur, ræsingu, lokun, diskastýringar og pakkakerfi. Stuðst er við kennsluefni frá NDG sem undirbýr nemendur undir alþjóðlegt próf LPIC-1.",
    "core": false,
    "active": true,
    "tbr": true,
    "bval": 2,
    "course_number": "KEST3LN05(EU)",
    "course_name": "Linux - netstjórnun",
    "prerequisites": [
      "KEST2UN05(CU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5dd69afbe3d27fe43f000546",
    "comment": "Má taka samhliða KEST2UN05(CU)",
    "description": "Í áfangum læra nemendur uppsetningu og rekstur Windows Server sem kerfisstjórnun. Megináhersla er lögð á Active Directory, DNS og DHCP þjónustur. Nemendur kynnast uppbyggingu Windows Server, aðgangsstjórnun notenda og hópa og reglustýringu (e. group policy). Kynnt er afritun og endurheimting gagna sem og diskstýringar (RAID).",
    "core": false,
    "active": true,
    "tbr": true,
    "bval": 2,
    "course_number": "KEST3WG05(DU)",
    "course_name": "Windows Server - grunnur",
    "prerequisites": [
      "KEST2UN05(CU)",
      "FORR2FA05(BU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5dd69bece3d27fe43f000551",
    "comment": "",
    "description": "Í áfanganum er farið dýpra í reglustýringar, DHCP (e. Dynamic Host Configuration Protocol) og DNS (e. Domain Name System). Nemendur læra að skrifa PowerShell skriftur til að setja upp Active Directory (AD), DHCP og DNS auk þess sem þeir læra að gera skriftur til að búa til notendur. Farið er í uppbyggingu Active Directory Schema og hvernig gera má breytingar á því. Nemendur vinna svo með Microsoft Internet Information Server (IIS) og Microsoft SQL Server eða skyldum þjónustum. Þá er fjallað um Virtual Private Networking (VPN) og öryggis- og eftirlitsmál.",
    "core": false,
    "active": false,
    "tbr": true,
    "bval": 2,
    "course_number": "KEST3WN05(EU)",
    "course_name": "Windows server - netstjórnun og skriftur I",
    "prerequisites": [
      "KEST3WG05(DU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5dd68d64e3d27fe43f000489",
    "comment": "",
    "description": "Í áfanganum er megináhersla á samskipti milli beina og skipta í litlu netkerfi. Farið er í innviði og virkni á netkerfisbúnaði, m.a. VLAN, static og dynamic routing, ACL, DHCP og NAT. Stuðst er við verklegar æfingar og tölvuhermi til að auka færni nemenda í að stilla og bilanagreina beina og skipta.",
    "core": false,
    "active": false,
    "tbr": true,
    "bval": 2,
    "course_number": "KEST3CR05(EU)",
    "course_name": "CCNA - Routing and Switching essentials",
    "prerequisites": [
      "KEST2UN05(CU)"
    ]
  },
  {
    "link": null,
    "comment": "",
    "description": "Í áfanganum er farið í Ethical Hacking – CyberOps Associate. Fyrirtæki þurfa að greina og bregðast við öryggisatvikum á skjótan og skilvirkan máta. Teymi í öryggisaðgerðarmiðstöðvum (Security Operations Centers, SOC) þurfa að hafa vakandi auga með öryggiskerfum til að vernda fyrirtækin með því að greina og bregðast við netógnunum. Áfanginn er góður undirbúningur fyrir Cisco Certified CyberOps Associate alþjóðlega vottun (200-201 CBROPS).",
    "core": false,
    "active": false,
    "tbr": true,
    "bval": 2,
    "course_number": "KEST3CO05(DU)",
    "course_name": "Ethical Hacking - CyberOps Associate",
    "prerequisites": [
      "KEST2UN05(CU)"
    ]
  },
  {
    "link": null,
    "comment": "",
    "description": "Í áfanganum er notuð aðferðarfræði og verkfæri við nútíma hugbúnaðargerð á rekstur upplýsingatæknibúnaðar og netkerfa. Farið er í örþjónustur, prófanir, containers og aðrar skýjalausnir, einnig sjálvirkni á innviðum með API og öryggi í samskiptum. Gerðar eru verklegar æfingar m.a. forritun í Python með notkun á GIT og algengum gagnaformum (JSON, XML og YAML) eru notuð til að flytja upplýsingar með Continuous Integration/Continuous Deployment(CI/CD) pípum.",
    "core": false,
    "active": true,
    "tbr": true,
    "bval": 2,
    "course_number": "KEST3DN05(DU)",
    "course_name": "DevNet Associate",
    "prerequisites": [
      "KEST2UN05(CU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5851616d62933a33a6021a60",
    "comment": "",
    "description": "Áfanginn er grunnáfangi í klassískri eðlisfræði. Lögð er áhersla á úrlausnarefni sem tengjast öðru námi nemenda við skólann. Helstu viðfangsefni eru: Hreyfing í einni vídd, fallhreyfing, kraftlögmál Newtons, áhrif núningskrafta, samband vinnu og ýmissa orkuforma, orka og varðveisla hennar, skriðþungavarðveisla, þrýstingur, uppdrif og inngangur að varmafræði.",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "EÐLI2GR05(BT)",
    "course_name": "Hreyfing, kraftar og orka",
    "prerequisites": [
      "STÆR2BR05(AT)"
    ]
  },
  {
    "link": "https://namskra.is/courses/585121a462933a33a60218a5",
    "comment": "",
    "description": "Í áfanganum er fjallað um vigra og hornaföll. Helstu efnisatriði: Vigrar og reikningur með þeim - Hornaföll - Hornafallareglur og sannanir þeirra - Jöfnur línu, hrings og sporbaugs - 2X2 fylki og notkun þeirra til að finna flatarmál þríhyrnings og leysa jöfnuhneppi",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "STÆR3RV05(CT)",
    "course_name": "Vigrar og hornaföll",
    "prerequisites": [
      "STÆR2AH05(BT)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5851246d62933a33a60218b7",
    "comment": "",
    "description": "Í áfanganum er fjallað um föll og diffrun þeirra. Helstu efnisatriði: - Föll og ferlar falla - Hliðrun falla, takmörkuð föll, einhalla föll , andhverfur falla, ýmsar tegundir falla - Markgildi og samfeldni - Snertill, diffurkvóti, afleiða - Ýmsar diffurreglur",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "STÆR3FM05(DT)",
    "course_name": "Föll, algebra og diffrun",
    "prerequisites": [
      "STÆR3RV05(CT)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5919a6f862933a4e92054456",
    "comment": "",
    "description": "Í áfanganum er farið í hlutbundið forritunarmál kennt frá grunni, en gert er ráð fyrir að nemendur þekki annað forritunarmál nokkuð vel, t.d. Python. Farið er ítarlega í: breytur, segðir, if setningar, lykkjur, föll/aðferðir, fylki og lista, strengjavinnsla skoðuð, klasar og skráarvinnsla. Einnig er hlutbundin forritun skoðuð ítarlega.",
    "core": false,
    "active": true,
    "tbr": true,
    "bval": 2,
    "course_number": "FORR3CG05(DU)",
    "course_name": "C++ og gagnagrindur",
    "prerequisites": [
      "FORR2HF05(CU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5dee326ae3d27faaec000415",
    "comment": "",
    "description": "Áfanginn er verklegur inngangsáfangi fyrir efni sem tengist fjórðu iðnbyltingunni. Nemendur læra grunnatriði í rafmagnsfræði og búa til einfaldar rafrásir. Nemendur kynnast mismunandi talnakerfum með áherslu á tvíundakerfið. Nemendur læra um Boolean algebru, sanntöflur, teikna rökrásir og setja þær upp á brauðbretti (e. breadboard). Nemendur kynnast einföldum íhlutum í rafrásum eins og viðnámi, skynjurum og mótorum og eiga geta notað þá með kóða. Nemendur setja saman vélbúnað og skrifa kóða sem nýtir sér all ofangreint í lokaverkefni.",
    "core": true,
    "active": true,
    "tbr": true,
    "bval": 0,
    "course_number": "VESM1VS05(AU)",
    "course_name": "Verksmiðja I",
    "prerequisites": []
  },
  {
    "link": "https://namskra.is/courses/5dee329be3d27faaec00041b",
    "comment": "",
    "description": "Áfanginn er verklegur framhaldsáfangi fyrir efni sem tengist fjórðu iðnbyltingunni. Nemendur kynnast hliðrænum og stafrænum skynjurum og virkni þeirra. Nemendur vinna með örgjörvaborð (t.d. arduino). Skoðuð eru einföld samskipti milli örgjörvaborða. Í áfanganum er lögð áhersla á tækjasmíði þar sem rafeindabúnaður er notaður við smíðina og forritun með C/C++ málinu. Áfanginn er verkefnadrifinn og eru unnin stærri og flóknari verkefni en í fyrsta áfanganum. Áhersla er lögð á sköpun og hönnun.",
    "core": true,
    "active": true,
    "tbr": true,
    "bval": 0,
    "course_number": "VESM2VT05(BU)",
    "course_name": "Verksmiðja II",
    "prerequisites": [
      "FORR1FG05(AU)",
      "VESM1VS05(AU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5dee32bee3d27faaec000421",
    "comment": "",
    "description": "Áfanginn er verklegur. Viðfangsefni áfangans er internet hlutanna (e. IoT) sem er samþætting tækja og hugbúnaðar tengda netinu, sem geta greint gögn og upplýsingar úr umhverfinu og miðlað þeim. Farið er í hlutverk og samskipti mismunandi tækja sem eru tengd saman á netinu. Unnið er með inntak frá tækjum og skynjurum, stýrikerfi, forritun, úttak og framsetningu gagna. Áfanginn er verkefnadrifinn og fást nemendur við hönnun og e. IoT frumgerðasmíð þar sem ýmis tæki og tól eru notuð.",
    "core": true,
    "active": true,
    "tbr": true,
    "bval": 0,
    "course_number": "VESM2VÞ05(CU)",
    "course_name": "Verksmiðja III",
    "prerequisites": [
      "VESM2VT05(BU)",
      "FORR2FA05(BU)",
      "KEST1VL05(AU)"
    ]
  },
  {
    "link": "https://namskra.is/courses/58511d2e62933a33a602187f",
    "comment": "",
    "description": "Í áfanganum er fjallað um rúmfræði með teikningum, tölfræði, líkindareikning og viðskiptareikning. Helstu efnisatriði: - Grundvallarhugtök og reglur í evklíðskri rúmfræði. - Mælingar í rúmfræði og mikilvægi nákvæmi - Grunnatriði tölfræði og líkindareiknings: Myndrit, meðaltal, miðgildi, tíðasta gildi, staðalfrávik, spönnun, einföld líkindi og fleira - Talningaraðferðir, flokkun gagnasafna og framsetning niðurstaðna - Viðskiptareikningur: Prósentur, álagning, afsláttur, virðisaukaskattur, vextir, vísitölur og fleira - Hagnýt verkefni um notkun viðskiptareiknings",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "STÆR2BR05(AT)",
    "course_name": "Rúm- og tölfræði, líkinda- og viðskiptarkn.",
    "prerequisites": []
  },
  {
    "link": "https://namskra.is/courses/58511e7662933a33a602188a",
    "comment": "",
    "description": "Í áfanganum er fjallað um algebru, föll, mengi og rökfræði. Helstu efnisatriði: - Algebra - Jöfnur með einni og tveimur óþekktum stærðum - Veldi og rætur - Ójöfnur - Föll - Ferlar falla - Hornaföll - Margliður - Táknmál mengjafræðinnar - Talnamengi - Mengjaaðgerðir - Rökfræði",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "STÆR2AH05(BT)",
    "course_name": "Algebra og föll",
    "prerequisites": [
      "STÆR2BR05(AT)"
    ]
  },
  {
    "link": "https://namskra.is/courses/585124b762933a33a60218bc",
    "comment": "",
    "description": "Í áfanganum er fjallað um diffurreglur og heildun. Helstu viðfangsefni: - Ýmsar afleiður - Útgildi - Beygjuskil - Könnun falla - Stofnafall, heildi flatarmál - Ákveðið heildi - Hlutheildun - Innsetningaraðferðin - Heildun ræðra falla - Rúmmál snúða",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "STÆR3FV05(ET)",
    "course_name": "Heildun falla, flatarmál og rúmmál snúða",
    "prerequisites": [
      "STÆR3FM05(DT)"
    ]
  },
  {
    "link": "https://namskra.is/courses/54e8eabf62933a1936000b47",
    "comment": "",
    "description": "Kjarnahugtök áfangans eru lestur og ritun. Áhersla er lögð á að nemendur efli færni sína í lestri. Þeir vinna markvisst að því að efla leshraða sinn og lesskilning á einstaklingsgrundvelli. Þeir nemendur sem þess þurfa fá ennfremur leiðbeiningar til þess að bæta kunnáttu sína í réttritun. Nemendur lesa mismunandi gerðir texta og bókmenntaverk frá ólíkum tímum og fjalla um gerð þeirra og inntak. Þeir þjálfast í ritun mismunandi texta og meðferð heimilda. Nemendur fá þjálfun í hugtakanotkun við umfjöllun um mismunandi texta, stíl þeirra og málsnið.",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "ÍSLE2AA05(AT)",
    "course_name": "Íslenska, lestur og ritun",
    "prerequisites": []
  },
  {
    "link": "https://namskra.is/courses/54e8eafb62933a1936000b4a",
    "comment": "",
    "description": "Í þessum áfanga er fjallað um mál og menningarsögu og áhersla er lögð á bókmenntir og ritun. Nemendur lesa íslenskar bókmenntir frá mismunandi tímum og ræða og fjalla um stíl þeirra og inntak í ræðu og riti. Þeir vinna með hugtök sem notuð eru við umfjöllun um bókmenntir og skrifa lengri og styttri texta. Nemendur læra um norræna goðafræði og lesa hluta Snorra-Eddu og Völuspá. Þeir læra um málsögu íslensku og helstu breytingar sem orðið hafa á málinu frá öndverðu. Ennfremur læra þeir að nýta sér heimildir og fá þjálfun í meðferð þeirra.",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "ÍSLE2GO05(BT)",
    "course_name": "Íslenskt mál og menningarsaga",
    "prerequisites": [
      "ÍSLE2AA05(AT)"
    ]
  },
  {
    "link": "https://namskra.is/courses/54e8eb4b62933a1936000b4d",
    "comment": "",
    "description": "Viðfangsefni áfangans er fornbókmenntir. Fjallað er um einkenni Íslendingasagna, ritunartíma þeirra og efni. Nemendur lesa Íslendingasögu og vinna fjölbreytt verkefni í tengslum við lesturinn. Fjallað er um eddukvæði, efni þeirra, einkenni og bragfræði. Nemendur lesa goða- og hetjukvæði. Þeir þjálfast enn frekar í ritgerðasmíð.",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 1,
    "course_number": "ÍSLE3BF05(CT)",
    "course_name": "Fornbókmenntir",
    "prerequisites": [
      "ÍSLE2GO05(BT)"
    ]
  },
  {
    "link": "https://namskra.is/courses/54e8eb7162933a1936000b51",
    "comment": "",
    "description": "Bókmenntir og bókmenntasaga tímabilsins 1550-1900 er viðfangsefni þessa áfanga. Nemendur kynnast helstu straumum og stefnum á tímabilinu og lesa skáldverk sem tengjast því. Lögð er áhersla á tengsl samfélags og bókmennta. Nemendur lesa ljóð og laust mál og fara ítarlega í bragfræði. Þeir vinna fjölbreytt skrifleg og munnleg verkefni.",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 1,
    "course_number": "ÍSLE3LF05(CT)",
    "course_name": "Bókmenntasaga 1550 - 1900",
    "prerequisites": [
      "ÍSLE2GO05(BT)"
    ]
  },
  {
    "link": "https://namskra.is/courses/54e8ebbd62933a1936000b55",
    "comment": "",
    "description": "Viðfangsefni áfangans er nútímabókmenntir og bókmenntasaga. Nemendur lesa fjölbreytt úrval bókmennta, ljóð og laust mál og vinna margvísleg verkefni í tengslum við lesturinn. Tengsl samfélags og bókmennta eru í forgrunni.",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 1,
    "course_number": "ÍSLE3NB05(CT)",
    "course_name": "Nútímabókmenntir",
    "prerequisites": [
      "ÍSLE2GO05(BT)"
    ]
  },
  {
    "link": "https://namskra.is/courses/54d780e962933a7ff50026ac",
    "comment": "",
    "description": "Í þessum byrjunaráfanga í dönsku er áhersla lögð á að nemendur verði vel læsir á flóknari texta en áður. Þeir verða þjálfaðir í að tileinka sér orðaforða, tjá hugsun sína skýrt í ræðu og riti og rökstyðja skoðanir sínar. Áhersla er lögð á vandlegan lestur texta með það fyrir augum að byggja upp virkan og hagnýtan orðaforða. Lesnir eru fjölbreyttir textar, bæði bókmenntatextar og sérhæfðari og flóknari textar en áður, en einnig unnið með lestur eftir áhugasviði nemenda. Lögð er áhersla á að nemendur beri ábyrgð á eigin námsframvindu og séu meðvitaðir um mismunandi aðferðir til að tileinka sér tungumál. Áhersla er lögð á sjálfstæð vinnubrögð.",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "DANS2BM05(AT)",
    "course_name": "Tjáning, lestur og menning",
    "prerequisites": []
  },
  {
    "link": "https://namskra.is/courses/5851492362933a33a6021989",
    "comment": "",
    "description": "Markmið áfangans er að efla menningarlæsi nemenda með því að þjálfa þá í að fræðast og tjá sig um ólík viðfangsefni á ensku. Nemendur bæta markvisst við orðaforða sinn, með áherslu á akademískan orðaforða, og öðlist dýpri skilning á flóknari málfræði enskrar tungu. Farið er yfir grundvallaratriði í ritun texta af ýmsum toga og nemendur æfa sig í nýtingu þeirra með hliðsjón af orðaforðanum sem farið er yfir í áfanganum. Lesin eru klassísk bókmenntaverk á enskri tungu og nemendur þjálfaðir í að rýna í bókmenntatexta og ræða umfjöllunarefni verkanna út frá eigin reynslu og skilningi.",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "ENSK2AE05(AT)",
    "course_name": "Bókmenntir og ritun",
    "prerequisites": []
  },
  {
    "link": "https://namskra.is/courses/52f0dde262933a50d0000853",
    "comment": "",
    "description": "Áhersla er lögð á að nemendur verði vel læsir á fjölbreyttari og þyngri texta en áður og gerð er aukin krafa um sjálfstæði í verkefnavinnu og vinnuskilum. Lesin eru óstytt bókmenntaverk og þau túlkuð út frá víðara samhengi en áður með tilliti til sögu og bókmenntalegra skírskotana. Lögð er áhersla á að nemendur verði færir um að tjá hugsun sína skýrt í ræðu og riti og geti rökstutt skoðanir sínar. Meginmarkmið áfangans er að nemendur kynnist sögu og menningu Bandaríkjanna með margvíslegum hætti þar sem alhliða færni í málinu er æfð. Nemendur rýna í ólíkan texta, bókmenntaverk, smásögur og greinar og fá tækifæri til að tjá sig á gagnrýninn hátt um viðfangsefnið.",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "ENSK2OF05(BT)",
    "course_name": "Fræðilegur orðaforði og Bandaríkin",
    "prerequisites": [
      "ENSK2AE05(AT)"
    ]
  },
  {
    "link": "https://namskra.is/courses/54e9040062933a1936000ba7",
    "comment": "",
    "description": "Áhersla er lögð á þekkingu nemenda á skólaumhverfinu. Fjallað er um vinnubrögð í námi, sjálfsmynd, skólakerfi og atvinnulíf, fjármál, neytendamál, umferðina, lýðræði og borgaralega vitund. Einnig er fjallað um næringu, mataræði, geðheilsu, kynhegðun og vanabindandi efni. Lögð er áhersla á sjálfstæð vinnubrögð nemenda, markmiðssetningu og úrvinnslu verkefna með kynningum.",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "LÍFS1GR05(AT)",
    "course_name": "Lífsleikni",
    "prerequisites": []
  },
  {
    "link": "https://namskra.is/courses/54c38ee562933a7ff50008fd",
    "comment": "",
    "description": "Innihald áfangans er breytilegt frá önn til annar en lögð er áhersla á að nemendur beiti gagnrýnni hugsun til þess að dýpka og efla læsi sitt á eigið umhverfi, efnislega og menningarlega. Nemendur læra að sjá umhverfi sitt í samhengi, hvernig menning okkar er og hvað það er sem hefur skapað hana og að þekkja rætur hennar. Nemendur kynna sér það sem er að gerast í menningarlífinu, meta það og skoða með aðstoð samnemenda og kennara. Námið er verkefnabundið og nemendur rannsaka viðfangsefni áfangans hverju sinni á gagnrýninn hátt. Dæmi um möguleg viðfangsefni: - Byggingarlist - Siðfræði - Hönnun - Myndlist - Leiklist - Tónlist - Menningarhugtakið",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "MENL1AL05(AT)",
    "course_name": "Menningarlæsi",
    "prerequisites": []
  },
  {
    "link": "https://namskra.is/courses/5851569162933a33a6021a1c",
    "comment": "",
    "description": "TODO",
    "core": false,
    "active": false,
    "tbr": false,
    "bval": 9,
    "course_number": "EFNA2AE05(BT)",
    "course_name": "Frumefni, sameindir og efnatengi",
    "prerequisites": []
  },
  {
    "link": "https://namskra.is/courses/54fdfce362933a4692000a50",
    "comment": "",
    "description": "TODO",
    "core": false,
    "active": false,
    "tbr": false,
    "bval": 9,
    "course_number": "EÐLI2RB05(CT)",
    "course_name": "Bylgjur, ljós og rafmagn",
    "prerequisites": [
      "EÐLI2GR05(BT)"
    ]
  },
  {
    "link": "https://namskra.is/courses/5851209d62933a33a6021894",
    "comment": "",
    "description": "TODO",
    "core": false,
    "active": false,
    "tbr": false,
    "bval": 9,
    "course_number": "STÆR2LT05(BT)",
    "course_name": "Tölfræði, talningafræði, líkindareikningur",
    "prerequisites": [
      "STÆR2BR05(AT)"
    ]
  },
  {
    "link": "https://namskra.is/courses/54e900d262933a1936000b7d",
    "comment": "",
    "description": "Þetta er bóklegur áfangi þar sem farið er yfir hvernig líkaminn bregst við í leik og starfi og undirbúning hans við væntanlegu álagi.",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "ÍÞRÓ1GH02(AT)",
    "course_name": "Líkaminn í leik og starfi",
    "prerequisites": []
  },
  {
    "link": "https://namskra.is/courses/54e9014562933a1936000b82",
    "comment": "",
    "description": "Í þessum áfanga stunda nemendur markvissa hreyfingu og öðlast þekkingu til þess að setja sér raunhæf markmið í heilsurækt.",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "ÍÞRÓ1LA01(AT)",
    "course_name": "Styrkur, líkamsbeyting, snerpa",
    "prerequisites": []
  },
  {
    "link": "https://namskra.is/courses/54e9017a62933a1936000b86",
    "comment": "",
    "description": "Í þessum áfanga stunda nemendur markvissa hreyfingu og öðlast þekkingu til þess að setja sér raunhæf markmið í heilsurækt.",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "ÍÞRÓ1LB01(BT)",
    "course_name": "Styrkur, líkamsbeyting, snerpa",
    "prerequisites": []
  },
  {
    "link": "https://namskra.is/courses/54e9024462933a1936000b8f",
    "comment": "",
    "description": "Í þessum áfanga stunda nemendur markvissa hreyfingu og öðlast þekkingu til þess að setja sér raunhæf markmið í heilsurækt.",
    "core": true,
    "active": true,
    "tbr": false,
    "bval": 0,
    "course_number": "ÍÞRÓ1LC01(CT)",
    "course_name": "Styrkur, líkamsbeyting, snerpa",
    "prerequisites": []
  }
]